In [1]:
import pandas as pd

In [4]:
data=[0.5, None, None, 0.53, 0.54, None, None, 0.59, 0.6, None, 0.7]
s=pd.Series(data)
s

0     0.50
1      NaN
2      NaN
3     0.53
4     0.54
5      NaN
6      NaN
7     0.59
8     0.60
9      NaN
10    0.70
dtype: float64

In [5]:
#Preencher com zeros os NaN
s.fillna(0)

0     0.50
1     0.00
2     0.00
3     0.53
4     0.54
5     0.00
6     0.00
7     0.59
8     0.60
9     0.00
10    0.70
dtype: float64

In [7]:
#outras formas de preencher
s

0     0.50
1      NaN
2      NaN
3     0.53
4     0.54
5      NaN
6      NaN
7     0.59
8     0.60
9      NaN
10    0.70
dtype: float64

In [8]:
#usa o valor anterior para preencher o null - isso é valido para time series
s.fillna(method = 'ffill')

0     0.50
1     0.50
2     0.50
3     0.53
4     0.54
5     0.54
6     0.54
7     0.59
8     0.60
9     0.60
10    0.70
dtype: float64

In [10]:
# metodo que faz o oposto, usa o valor debaixo
s
s.fillna(method = 'bfill')

0     0.50
1     0.53
2     0.53
3     0.53
4     0.54
5     0.59
6     0.59
7     0.59
8     0.60
9     0.70
10    0.70
dtype: float64

In [12]:
#vamos fill agora com a media de todos os valore nao nulos
s
s.fillna(s.mean())

0     0.500000
1     0.576667
2     0.576667
3     0.530000
4     0.540000
5     0.576667
6     0.576667
7     0.590000
8     0.600000
9     0.576667
10    0.700000
dtype: float64

In [13]:
s
#limit vai fazer o ffill mas nao vai fazer eternamente, mas so uma vez
s.fillna(method = 'ffill', limit = 1)
# se eu colocasse limit=2 preencheria tudo

0     0.50
1     0.50
2      NaN
3     0.53
4     0.54
5     0.54
6      NaN
7     0.59
8     0.60
9     0.60
10    0.70
dtype: float64

In [14]:
#posso querer preencher com o de cima e o debaixo
s1=s.fillna(method = 'ffill', limit = 1)
s1

0     0.50
1     0.50
2      NaN
3     0.53
4     0.54
5     0.54
6      NaN
7     0.59
8     0.60
9     0.60
10    0.70
dtype: float64

In [16]:
s1.fillna(method = 'bfill', limit = 1)
#veja que ele usa o valoer debaixo agora em 2 e em 6

0     0.50
1     0.50
2     0.53
3     0.53
4     0.54
5     0.54
6     0.59
7     0.59
8     0.60
9     0.60
10    0.70
dtype: float64

Exercicios

In [17]:
atletas = pd.DataFrame([['Marcos', 9.62], ['Pedro', None], ['João', 9.69], 
                        ['Beto', 9.72], ['Sandro', None], ['Denis', 9.69], 
                        ['Ary', None], ['Carlos', 9.74]], 
                        columns = ['Corredor', 'Melhor Tempo'])
atletas

  Corredor  Melhor Tempo
0   Marcos          9.62
1    Pedro           NaN
2     João          9.69
3     Beto          9.72
4   Sandro           NaN
5    Denis          9.69
6      Ary           NaN
7   Carlos          9.74

In [19]:
#atribuir o tempo médio de todos os atletas aos dados faltantes.
atletas.fillna(atletas.mean(), inplace = True)
atletas

  Corredor  Melhor Tempo
0   Marcos         9.620
1    Pedro         9.692
2     João         9.690
3     Beto         9.720
4   Sandro         9.692
5    Denis         9.690
6      Ary         9.692
7   Carlos         9.740

Com o inplace=True o DataFrame atletas vai ser alterado pelo fillna(), enquanto com inplace=False ou sem inplace, vai ser retornado um novo DataFrame com as alterações do fillna() e o original alunos vai continuar sem alterações.

Assim o professor não utiliza o inplace na aula porque quer apenas demonstrar os usos do fillna() sem salvar as alterações, o objetivo é apenas ver o resultado.

In [21]:
atletas = pd.DataFrame([['Marcos', 9.62], ['Pedro', None], ['João', 9.69], 
                        ['Beto', 9.72], ['Sandro', None], ['Denis', 9.69], 
                        ['Ary', None], ['Carlos', 9.74]], 
                        columns = ['Corredor', 'Melhor Tempo'])
atletas
atletas.mean()

Melhor Tempo    9.692
dtype: float64

In [ ]:
#me da a media

In [22]:
# Usando uma formula ao inves da media
# Exemplo simples com a função: y = -x² + 5x
import pandas as pd
import numpy as np

# Montagem dos dados iniciais
df = pd.DataFrame({
    'X': [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'Y': [0, 4, np.nan, 6, np.nan, 0, np.nan, np.nan, -24, np.nan, -50]
})
df

     X     Y
0    0   0.0
1    1   4.0
2    2   NaN
3    3   6.0
4    4   NaN
5    5   0.0
6    6   NaN
7    7   NaN
8    8 -24.0
9    9   NaN
10  10 -50.0

In [23]:
# Função que aplica a fórmula definida
def funcao(x):
    # y = -x² + 5x
    return -(x ** 2) + (5 * x)

In [24]:
# Função a ser aplicada em cada linha do DataFrame para aplicar a fórmula caso necessário
def preenche(row):
    return funcao(row['X']) if pd.isnull(row['Y']) else row['Y']

In [25]:
df['Y'] = df.apply(preenche, axis=1)

In [26]:
df

     X     Y
0    0   0.0
1    1   4.0
2    2   6.0
3    3   6.0
4    4   4.0
5    5   0.0
6    6  -6.0
7    7 -14.0
8    8 -24.0
9    9 -36.0
10  10 -50.0

In [27]:
# veja linha 2 coluna Y : -2^2+5.2=-4+10=6

Objetivo for preencher com "0" apenas os dados NaN da feature "Valor" das linhas que possuem IPTU < 100, como isso seria implementado usando os recursos do Pandas e/ou Numpy?

In [28]:
# imports
import pandas as pd
import numpy as np

# Criação do DataFrame
imoveis = pd.DataFrame([['Apartamento', None, 970, 68], 
                        ['Apartamento', 2000, 878, 112], 
                        ['Casa', 5000, None, 500], 
                        ['Apartamento', None, 1010, 170], 
                        ['Apartamento', 1500, 850, None], 
                        ['Casa', None, None, None], 
                        ['Apartamento', 2000, 878, None], 
                        ['Apartamento', 1550, None, 228], 
                        ['Apartamento', 2500, 880, 195]], 
                        columns = ['Tipo', 'Valor', 'Condominio', 'IPTU'])
imoveis

          Tipo   Valor  Condominio   IPTU
0  Apartamento     NaN       970.0   68.0
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         NaN  500.0
3  Apartamento     NaN      1010.0  170.0
4  Apartamento  1500.0       850.0    NaN
5         Casa     NaN         NaN    NaN
6  Apartamento  2000.0       878.0    NaN
7  Apartamento  1550.0         NaN  228.0
8  Apartamento  2500.0       880.0  195.0

In [29]:
# Substituição dos valores
# Criação do substitui para verificar e retornar o valor correto
def substitui(linha):
    if (np.isnan(linha["Valor"])) & (linha["IPTU"] < 100):
        return 0
    else:
        return linha["Valor"]

In [30]:
# Aplicação do substitui criado
imoveis["Valor"] = imoveis.apply(substitui, axis=1)

In [31]:
imoveis

          Tipo   Valor  Condominio   IPTU
0  Apartamento     0.0       970.0   68.0
1  Apartamento  2000.0       878.0  112.0
2         Casa  5000.0         NaN  500.0
3  Apartamento     NaN      1010.0  170.0
4  Apartamento  1500.0       850.0    NaN
5         Casa     NaN         NaN    NaN
6  Apartamento  2000.0       878.0    NaN
7  Apartamento  1550.0         NaN  228.0
8  Apartamento  2500.0       880.0  195.0